"use strict"

// Какой или какие из вариантов не верны:

/*
//Вариант №1
console.log('35' + - "22");
//Вернет 13 - НЕВЕРНО, вернет строку 35-22

//Вариант №2
console.log('35' * "22");
//Вернет 770 - ВЕРНО

//Вариант №3
console.log('558' > 22++);
//Вернет true - ВЕРНО ???

//Вариант №4
let usersCounter = 0;
let newUsers = usersCounter++;
console.log(newUsers);
//Вернет 1 - НЕВЕРНО, ВЕРНЕТ 0

//Вариант №5
console.log(!false && 11 || 18 && !'');
//Вернет 18 - НЕВЕРНО, ВЕРНЕТ 11

//Вариант №6
let name = 0;
console.log(name ?? "Без имени") - ВЕРНЕТ 0???
*/

